---
kind: property
id: P:Autodesk.Revit.UI.PushButtonData.AvailabilityClassName
zh: 按钮
source: html/f7fb1481-da65-e993-02e1-d16bc84bb177.htm
---
# Autodesk.Revit.UI.PushButtonData.AvailabilityClassName Property

**中文**: 按钮

The full class name for the class providing the entry point to decide availability of this push button.

## Syntax (C#)
```csharp
public string AvailabilityClassName { get; set; }
```

## Remarks
This is the class implementing IExternalCommandAvailability interface.